openss7/openss7/streams/doc/man/man9/str_install_AIX.9.man
'\" rtp
.\" -*- nroff -*- vim: ft=nroff nocin nosi
.\"
.\" @(#) $Id: str_install_AIX.9.man,v 0.9.2.19 2008-04-28 12:53:55 brian Exp $
.\"
.\" =========================================================================
.\"
.\" Copyright (c) 2001-2008  OpenSS7 Corporation <http://www.openss7.com/>
.\"
.\" All Rights Reserved.
.\"
.\" Permission is granted to make and distribute verbatim copies of this
.\" manual provided the copyright notice and this permission notice are
.\" preserved on all copies.
.\"
.\" Permission is granted to copy and distribute modified versions of this
.\" manual under the conditions for verbatim copying, provided that the
.\" entire resulting derived work is distributed under the terms of a
.\" permission notice identical to this one
.\" 
.\" Since the Linux kernel and libraries are constantly changing, this
.\" manual page may be incorrect or out-of-date.  The author(s) assume no
.\" responsibility for errors or omissions, or for damages resulting from
.\" the use of the information contained herein.  The author(s) may not
.\" have taken the same level of care in the production of this manual,
.\" which is licensed free of charge, as they might when working
.\" professionally.  The author(s) will take no responsibility in it.
.\" 
.\" Formatted or processed versions of this manual, if unaccompanied by
.\" the source, must acknowledge the copyright and authors of this work.
.\"
.\" -------------------------------------------------------------------------
.\"
.\" U.S. GOVERNMENT RESTRICTED RIGHTS.  If you are licensing this Software
.\" on behalf of the U.S. Government ("Government"), the following
.\" provisions apply to you.  If the Software is supplied by the Department
.\" of Defense ("DoD"), it is classified as "Commercial Computer Software"
.\" under paragraph 252.227-7014 of the DoD Supplement to the Federal
.\" Acquisition Regulations ("DFARS") (or any successor regulations) and the
.\" Government is acquiring only the license rights granted herein (the
.\" license rights customarily provided to non-Government users).  If the
.\" Software is supplied to any unit or agency of the Government other than
.\" DoD, it is classified as "Restricted Computer Software" and the
.\" Government's rights in the Software are defined in paragraph 52.227-19
.\" of the Federal Acquisition Regulations ("FAR") (or any successor
.\" regulations) or, in the cases of NASA, in paragraph 18.52.227-86 of the
.\" NASA Supplement to the FAR (or any successor regulations).
.\"
.\" =========================================================================
.\" 
.\" Commercial licensing and support of this software is available from
.\" OpenSS7 Corporation at a fee.  See http://www.openss7.com/
.\" 
.\" =========================================================================
.\"
.\" Last Modified $Date: 2008-04-28 12:53:55 $ by $Author: brian $
.\"
.\" -------------------------------------------------------------------------
.\"
.\" $Log: str_install_AIX.9.man,v $
.\" Revision 0.9.2.19  2008-04-28 12:53:55  brian
.\" - update file headers for release
.\"
.\" Revision 0.9.2.18  2006/04/05 09:44:18  brian
.\" - moved .so line and updated headers
.\"
.\" =========================================================================
.R1
bracket-label "\fR[\fB" "\fR]" "\fR, \fB"
no-default-database
database streams.refs
accumulate
move-punctuation
abbreviate A
join-authors ", " ", " " and "
et-al " et al" 2 3
abbreviate-label-ranges ".."
sort-adjacent-labels
.R2
.so streams.macros
.\"
.\"
.TH STR_INSTALL 9 "@PACKAGE_DATE@" "@PACKAGE@-@VERSION@" "@PACKAGE_TITLE@ DDI/DKI"
.\"
.\"
.SH NAME
.B str_install
\- install or uninstall a \fISTREAMS\fP driver or module
.\"
.\"
.SH SYNOPSIS
.PP
.B #define _AIX_SOURCE
.br
.B #include <sys/streams.h>
.br
.B #include <sys/strconf.h>
.br
.B #include <sys/ddi.h>
.HP
.BI "int str_install(int " cmd ", strconf_t *" conf );
.\"
.\"
.SH ARGUMENTS
.PP
.TP
.I cmd
specifies the action to perform.
.I cmd
can be one of the following values:
.RS
.TP 16
.B STR_LOAD_DEV
add a device
.PD 0
.TP
.B STR_UNLOAD_DEV
remove a device
.TP
.B STR_LOAD_MOD
load a module
.TP
.B STR_UNLOAD_MOD
unload a module
.PD
.RE
.TP
.I conf
a pointer to a
.BR strconf_t (9)
structure specifying the characteristics of the driver or module upon which to
perform the action.
.\"
.\"
.SH DESCRIPTION
.PP
.\"
.\"
.PP
.I conf
points to a
.BR strconf_t (9)
structure contains the following members:
.sp
.nf
\fC\s-2\
typedef struct {
        char *sc_name;
        struct streamtab *sc_str;
        int sc_open_stylesc_flags;
        int sc_major;
        int sc_sqlevel;
        caddr_t sc_sqinfo;
} strconf_t;
\s+2\fP
.fi
.TP
.I sc_name
Specifies the name of the driver or module.  For modules, this name is
installed in the
.B fmodsw
table and is used for
.BR I_PUSH
operations (see
.BR streamio (7)).
For drivers, this name is used only for reporting with the
.BR scls (8)
and
.BR strinfo (8)
commands.
.TP
.I sc_str
A pointer to the
.BR streamtab (9)
structure.
.TP
.I sc_open_stylesc_flags
Gosh does that ever look like a typo!
Specifies the style of the driver or module
.IR qi_qopen (9)
procedure and characteristics
of the driver or module.  Possible values are:
.RS
.PP
One of the following two flags must be set to indicate the style of
the module's
.IR qi_qopen (9)
procedure:
.TP
.B STR_NEW_OPEN
The
.IR qi_qopen (9)
syntax and semantics as used in
.IR "SVR 4" .
.[
svr4
.]
.TP
.B STR_OLD_OPEN
The
.IR qi_qopen (9)
syntax and semantics as used in
.IR "SVR 3"
.[
svr3
.]
.PP
If the module is multiprocessor-safe, the following flag should be added by
using the bitwise OR operator:
.TP
.B STR_MPSAFE
The driver or module was designed to be run on an MP system.
.PP
If the module uses callback functions that need to be protected against
interrupts (non-interrupt-safe callback functions) for the
.BR timeout (9)
or
.BR bufcall (9)
callbacks, the following flag should be added by using the bitwise OR
operator:
.TP
.B STR_QSAFETY
Specifies that the driver or module uses non-interrupt-safe callback functions
for the
.BR timeout (9)
or
.BR bufcall (9)
callbacks.
(See also
.BR itimeout (9).)
This flag is automatically set by
.I STREAMS
if the module is not multiprocesor-safe.
.TP
.B STR_PERSTREAM
Specifies that the module accepts to run at per-stream synchronization level.
.TP
.B STR_Q_NOTTOSPEC
Specifies that the module is designed to run it's
.IR qi_srvp (9)
procedure under process context.
By default
.I STREAMS
.IR qi_srvp (9)
procedure run at interrupt context (softIRQ).  If the
.I STREAMS
module wants to execute its
.IR qi_srvp (9)
procedure under process context, it needs to set this flag.
.TP
.B STR_64BIT
Specifies that the module is capable of supporting 64-bit data types.
.TP
.B STR_NEWCLONING
Specifies that the driver
.IR qi_qopen (9)
uses new-style cloning.  Under this style, the
driver
.IR qi_qopen (9)
does not check for
.B CLONEOPEN
and yet returns a new device number.
.RE
.TP
.I sc_major
Specifies the major number of the device.
.TP
.I sc_sqlevel
Specifies the synchronization level to be used by
.I STREAMS
for the module.  There are seven levels of synchronization as follows:
.RS
.TP
.BR SQLVL_NOP "\- No synchronization"
Specifies that each queue can be accessed by more than one thread at the same
time.  The protection of internal data and of
.IR qi_putp (9)
and
.IR qi_srvp (9)
procedure against
.BR timeout (9)
or
.BR bufcall (9)
is done by the driver or module itself.  This synchronization level should be
used essentially for multiprocessor-efficient modules.
.TP
.BR SQLVL_QUEUE "\- Queue level"
Specifies that each queue can be accessed by only one thread at the same time.
This is the finest synchronization level, and should only be used when the two
sides of a queue pair do not share common data.
.TP
.BR SQLVL_QUEUEPAIR "\- Queue pair level"
Specifies that each queue pair can be accessed by only one thread at the same
time.
.TP
.BR SQLVL_MODULE "\- Module level"
Specifies that all instances of a module can be accessed by only one thread at
the same time.  This is the default value.
.TP
.BR SQLVL_ELSEWHERE "\- Arbitrary level"
Specifies that a group of modules can be accessed by only one thread at the
same time.  Usually, the group of modules is a set of cooperating modules, such
as a protocol family.  The group is defined by using the same name in the
.I sc_sqinfo
field for each module in the group.
.TP
.BR SQLVL_GLOBAL "\- Global level"
Specifies that all of
.I STREAMS
can be accessed by only one thread at the same time.  This option should
normally be used only for debugging.
.TP
.BR SQLVL_DEFAULT "\- Default level"
Specifies the default level, set to
.BR SQLVL_MODULE .
.RE
.TP
.I sc_sqinfo
Specifies an optional group name.  This field is only used when the
.BR SQLVL_ELSEWHERE
arbitrary synchronization level is set; all modules having the same name belong
to one group.  The name size is limited to eight
.RB ( FMNAMESZ )
characters.
.\"
.\"
.SH RETURN
.PP
When
.BR str_install ()
succeeds, it returns zero (0);
when it fails, it returns
a non-zero (positive) error code.
.\"
.\"
.SH ERRORS
.PP
When
.BR str_install ()
fails, it returns one of the following (positive) error codes:
.TP \w'[ENOMEM]\(em'u
.RB [ EBUSY ]
The module is in use and cannot be unloaded.
.TP
.RB [ EEXIST ]
The module already exists in the system.
.TP
.RB [ EINVAL ]
An argument contains an invalid value.
.TP
.RB [ ENODEV ]
The module could not be loaded.
.TP
.RB [ ENOENT ]
The module is not present and cannot be unloaded.
.TP
.RB [ ENOMEM ]
Insufficient memory was available to complete the request.
.TP
.RB [ ENXIO ]
.I STREAMS
is currently locked.
.\"
.\"
.SH CONTEXT
.PP
.BR str_install ()
should be called from User Context.
.BR str_install ()
is intended to be called by kernel module initialization routines.
.\"
.\"
.SH MP-STREAMS
.PP
.BR str_install ()
is MP-safe.
.\"
.\"
.SH NOTICES
.PP
.BR str_install ()
is a
.IR AIX \(rg-specific
function:
.B _AIX_SOURCE
must be defined before including DDI/DKI include files to expose this symbol.
.B Linux Fast-STREAMS
must also have been compiled with
.B CONFIG_STREAMS_COMPAT_AIX
or
.B CONFIG_STREAMS_COMPAT_AIX_MODULE
defined.
.\"
.\"
.SH "SEE ALSO"
.PP
.BR STREAMS (9).
.\"
.\"
.SH BUGS
.PP
.BR str_install ()
has no known bugs.
.\"
.\"
.SH COMPATIBILITY
.PP
.BR str_install ()
is compatible with
.IR AIX \(rg
with the following portability considerations:
.IP \(em \w'\(em\(em'u
Under
.IR AIX \(rg
to support dynamic loading and unloading of kernel modules, each
.I STREAMS
driver or module provides a configuration procedure.  This procedure is called
each time the extension is referenced in a load or unload operation.  The
system provides a name and a device number when the module loads.
.IP ""
Under
.B Linux
it is necessary to hook into the
.BR module_init (9)
and
.BR module_term (9)
procedures and assign the
.I name
and
.I dev
number using
.BR MOD_PARM (9).
By convention, these module options are called
.I name
and
.IR major .
.IP ""
A driver's
.BR module_init (9)
routine should assign
.I name
and
.I major
to the
.B strconf_t
structure and call
.BR str_install ()
with
.BR STR_LOAD_DEV ;
the
.BR module_term (9)
routine should call
.BR str_install ()
with
.BR STR_UNLOAD_DEV .
.IP ""
A module's
.BR module_init (9)
routine should call
.BR str_install ()
with
.BR STR_LOAD_MOD ;
the
.BR module_term (9)
routine should call
.BR str_install ()
with
.BR STR_UNLOAD_MOD .
.IP \(em
Use of
.BR str_install ()
requires different include file sequences on
.B Linux Fast-STREAMS
.[
lfs
.]
than on
.IR AIX \(rg.
.IR AIX \(rg
includes
.B <pse/mi.h>
and
.B <sys/stream.h>
only.
.IP \(em
On
.IR AIX \(rg
.[
aixspg
.]
synchronization flags are not supported.  On
.B Linux Fast-STREAMS
.[
lfs
.]
synchronization flags are fully supported.
.IP \(em
.BR str_install ()
is provided for source level compatibility with
.IR AIX \(rg
for the purpose of porting
.IR AIX \(rg
drivers to
.BR Linux .
Because internal structures and definitions for
.B Linux Fast-STREAMS
.[
lfs
.]
differ from that of
.IR AIX \(rg,
binaries are incompatible.
.IP \(em
.BR str_install ()
only provides functionality comparable to
.IR AIX \(rg
for use by
.I STREAMS
drivers and modules.
Any and all functionality provided by
.BR str_install ()
in support of
.RI non- STREAMS
devices are not supported.
.PP
See
.BR STREAMS (9)
for additional compatibility considerations.
.\"
.\"
.SH CONFORMANCE
.PP
.IR AIX \(rg
DDI documentation.
.[
aixdoc
.]
.[
aixspg
.]
.\"
.\"
.SH HISTORY
.PP
.BR str_install ()
first appeared in
.IR AIX \(rg.
.\"
.\"
.[
$LIST$
.]
.TI
